"The Unarchiver/Unarchive To Current Folder" = "The Unarchiver/Распаковать в текущую папку";

"The Unarchiver/Unarchive To Desktop" = "The Unarchiver/Распаковать на Рабочий стол";

"The Unarchiver/Unarchive To..." = "The Unarchiver/Распаковать в...";
